In [9]:
import pickle
import os
import pandas as pd

In [5]:
os.chdir('/home/tatras/Documents/internship 2/FootLocker/data') #Changing working directory !!!

In [13]:
with open('weekly_sales100.pkl', 'rb') as f: # Loading data using pickle file !!!
    data = pickle.load(f)

In [14]:
data.head()

           sku store_number  week1  week2  week3  week4  week5
0  03420100304      0306913    1.0    NaN    NaN    NaN    NaN
1  03420100304      0306914    1.0    NaN    NaN    1.0    NaN
2  03420100304      0306959    1.0    5.0    3.0    2.0    NaN
3  03420100304      0306960    1.0    NaN    NaN    NaN    NaN
4  03420100304      0306972    1.0    1.0    1.0    NaN    NaN

In [16]:
data.fillna(0, inplace = True) #Fill NaN values with 0

In [17]:
data.head()

           sku store_number  week1  week2  week3  week4  week5
0  03420100304      0306913    1.0    0.0    0.0    0.0    0.0
1  03420100304      0306914    1.0    0.0    0.0    1.0    0.0
2  03420100304      0306959    1.0    5.0    3.0    2.0    0.0
3  03420100304      0306960    1.0    0.0    0.0    0.0    0.0
4  03420100304      0306972    1.0    1.0    1.0    0.0    0.0

In [225]:
df_sku = pd.DataFrame()

In [226]:
df_sku['week1_total_sales'] = data.groupby('sku')['week1'].sum()
df_sku['week2_total_sales'] = data.groupby('sku')['week2'].sum()
df_sku['week3_total_sales'] = data.groupby('sku')['week3'].sum()
df_sku['week4_total_sales'] = data.groupby('sku')['week4'].sum()
df_sku['week5_total_sales'] = data.groupby('sku')['week5'].sum()
df_sku.reset_index(inplace = True)

In [227]:
df_sku['sku_overall_sales'] = df_sku.iloc[:, 1:6].sum(axis = 1)

In [228]:
df_sku.head()

,sku,week1_total_sales,week2_total_sales,week3_total_sales,week4_total_sales,week5_total_sales,sku_overall_sales
0,03420100304,241.0,74.0,57.0,59.0,66.0,497.0
1,03420100404,76.0,23.0,16.0,52.0,12.0,179.0
2,03420100904,26.0,12.0,10.0,96.0,13.0,157.0
3,03420102204,191.0,108.0,90.0,163.0,296.0,848.0
4,03420102304,183.0,75.0,104.0,222.0,255.0,839.0

In [229]:
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline

In [230]:
df_sku.week1_total_sales.describe()

count     6031.000000
mean       431.765213
std        919.961517
min          2.000000
25%         94.000000
50%        215.000000
75%        467.500000
max      25930.000000
Name: week1_total_sales, dtype: float64

In [240]:
data_dict_sku={}
outliers_sku = {'week1_total_sales':'week1_out', 'week2_total_sales':'week2_out', 'week3_total_sales':'week3_out', 'week4_total_sales':'week4_out', 'week5_total_sales':'week5_out', 'sku_overall_sales':'overall_out'}

In [259]:
for i, j in outliers_sku.items():    
    q1 = df_sku[i].quantile([0.25, 0.75]).iloc[0]
    q3 = df_sku[i].quantile([0.25, 0.75]).iloc[1]
    iqr = q3 - q1
    upper_lim = q3 + 1.5*iqr
    lower_lim = q1 - 1.5*iqr
    up_outliers = df_sku.sku[df_sku.week1_total_sales > upper_lim].values.tolist()
    low_outliers = df_sku.sku[df_sku.week1_total_sales < lower_lim].values.tolist()
    total_outliers = up_outliers + low_outliers
    data_dict_sku[i]=(up_outliers,low_outliers)

In [260]:
data_dict_sku.keys()

dict_keys(['week1_total_sales', 'week2_total_sales', 'week3_total_sales', 'week4_total_sales', 'week5_total_sales', 'sku_overall_sales'])

In [261]:
data_dict_sku["sku_overall_sales"]

(['03420921904',
  '03420951904',
  '03420952104',
  '03421825604',
  '03421846504',
  '03421863604',
  '03421863704',
  '03421924604',
  '03626517404',
  '03626523004',
  '03626688704',
  '03626699904',
  '03626719504',
  '03626722304',
  '03626724304',
  '03626738804',
  '03626788404',
  '03626968404',
  '03626996104',
  '03626996504',
  '03626998104',
  '03626998604',
  '03627220604',
  '16626571304',
  '16626894404',
  '16626926004',
  '16626956704',
  '16626957104',
  '16626958304',
  '16626959904',
  '16627036204',
  '16627037004',
  '16628295904',
  '16628296604',
  '18420003704',
  '18420125904',
  '18421053704',
  '18421441304',
  '18421691504',
  '18421691604',
  '18622226404',
  '18622900504',
  '29420951904',
  '29420952104',
  '29421846504',
  '29421924604',
  '29626996504',
  '29627220604'],
 [])

In [235]:
df_store = pd.DataFrame()

In [236]:
df_store['week1_total_sales'] = data.groupby('store_number')['week1'].sum()
df_store['week2_total_sales'] = data.groupby('store_number')['week2'].sum()
df_store['week3_total_sales'] = data.groupby('store_number')['week3'].sum()
df_store['week4_total_sales'] = data.groupby('store_number')['week4'].sum()
df_store['week5_total_sales'] = data.groupby('store_number')['week5'].sum()
df_store.reset_index(inplace = True)

In [237]:
df_store['store_overall_sales'] = df_store.iloc[:, 1:6].sum(axis = 1)

In [239]:
df_store.head()

,store_number,week1_total_sales,week2_total_sales,week3_total_sales,week4_total_sales,week5_total_sales,store_overall_sales
0,0306001,32.0,5.0,46.0,2.0,0.0,85.0
1,0306005,17.0,1.0,2.0,43.0,4.0,67.0
2,0306018,10.0,0.0,1.0,2.0,41.0,54.0
3,0306034,10.0,0.0,0.0,42.0,42.0,94.0
4,0306046,21.0,0.0,44.0,44.0,2.0,111.0

In [264]:
data_dict_store={}
outliers_store = {'week1_total_sales':'week1_out', 'week2_total_sales':'week2_out', 'week3_total_sales':'week3_out', 'week4_total_sales':'week4_out', 'week5_total_sales':'week5_out', 'store_overall_sales':'overall_out'}

In [265]:
for i, j in outliers_store.items():    
    q1 = df_store[i].quantile([0.25, 0.75]).iloc[0]
    q3 = df_store[i].quantile([0.25, 0.75]).iloc[1]
    iqr = q3 - q1
    upper_lim = q3 + 1.5*iqr
    lower_lim = q1 - 1.5*iqr
    up_outliers = df_store.store_number[df_store.week1_total_sales > upper_lim].values.tolist()
    low_outliers = df_store.store_number[df_store.week1_total_sales < lower_lim].values.tolist()
    total_outliers = up_outliers + low_outliers
    data_dict_store[i]=(up_outliers,low_outliers)

In [266]:
data_dict_store.keys()

dict_keys(['week1_total_sales', 'week2_total_sales', 'week3_total_sales', 'week4_total_sales', 'week5_total_sales', 'store_overall_sales'])

In [268]:
data_dict_store["store_overall_sales"] # From here you can obtain outliers for any column !!!

(['0308155', '0308747'], [])